FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_MCI.c
/*-------------------------------------------------------------------------*
 * File:  LPC1788_MCI.c
 *-------------------------------------------------------------------------*
 * Description:
 *     
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2012 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------*
 * Includes:
 *-------------------------------------------------------------------------*/
#include <string.h>
#include <uEZ.h>
#include <uEZProcessor.h>
#include <uEZPlatformAPI.h>
#include <HAL/Interrupt.h>
#include <HAL/GPDMA.h>
#include "LPC1788_MCI.h"
#include "LPC1788_GPIO.h"

/*-------------------------------------------------------------------------*
 * Constants:
 *-------------------------------------------------------------------------*/
#if ((COMPILER_TYPE==RowleyARM) || (COMPILER_TYPE==Keil4))
    #define MCI_MEMORY __attribute__((section(".mcimem")));
#elif (COMPILER_TYPE==IAR)
    #define MCI_MEMORY @ ".mcimem"
#else
    #define MCI_MEMORY // no mods
#endif

#ifndef NUM_MAX_BLOCKS
    #define NUM_MAX_BLOCKS               18         /* Block transfer FIFO depth (>= 2), 20+ recommended */
#endif

#ifndef SDCARD_MCI_RATE_FOR_RW_STATE
    #define SDCARD_MCI_RATE_FOR_RW_STATE       20000000UL // 18000000UL // 18 MHz  // TODO: Need to remove!
#endif

// Easy remap of registers:
#define MCI_POWER       LPC_MCI->POWER
#define MCI_CLOCK       LPC_MCI->CLOCK
#define MCI_COMMAND     LPC_MCI->COMMAND
#define MCI_CLEAR       LPC_MCI->CLEAR
#define MCI_ARGUMENT    LPC_MCI->ARGUMENT
#define MCI_STATUS      LPC_MCI->STATUS
#define MCI_RESP0       LPC_MCI->RESP0
#define MCI_RESP1       LPC_MCI->RESP1
#define MCI_RESP2       LPC_MCI->RESP2
#define MCI_RESP3       LPC_MCI->RESP3
#define MCI_MASK0       LPC_MCI->MASK0
#define MCI_DATA_CTRL   LPC_MCI->DATACTRL
#define MCI_DATA_LEN    LPC_MCI->DATALEN
#define MCI_DATA_TMR    LPC_MCI->DATATMR
#define MCI_FIFO        LPC_MCI->FIFO

/* MCIStatus register bits: */
#define MCI_STATUS_CMD_CRC_FAIL         (1<<0)
#define MCI_STATUS_DATA_CRC_FAIL        (1<<1)
#define MCI_STATUS_CMD_TIME_OUT         (1<<2)
#define MCI_STATUS_DATA_TIME_OUT        (1<<3)
#define MCI_STATUS_TX_UNDERRUN          (1<<4)
#define MCI_STATUS_RX_OVERRUN           (1<<5)
#define MCI_STATUS_CMD_RESP_END         (1<<6)
#define MCI_STATUS_CMD_CMD_SENT         (1<<7)
#define MCI_STATUS_DATA_END             (1<<8)
#define MCI_STATUS_START_BIT_ERR        (1<<9)
#define MCI_STATUS_DATA_BLOCK_END       (1<<10)
#define MCI_STATUS_CMD_ACTIVE           (1<<11)
#define MCI_STATUS_TX_ACTIVE            (1<<12)
#define MCI_STATUS_RX_ACTIVE            (1<<13)
#define MCI_STATUS_TX_FIFO_HALF_EMPTY   (1<<14)
#define MCI_STATUS_RX_FIFO_HALF_FULL    (1<<15)
#define MCI_STATUS_TX_FIFO_FULL         (1<<16)
#define MCI_STATUS_RX_FIFO_FULL         (1<<17)
#define MCI_STATUS_TX_FIFO_EMPTY        (1<<18)
#define MCI_STATUS_RX_FIFO_EMPTY        (1<<19)
#define MCI_STATUS_TX_DATA_AVAIL        (1<<20)
#define MCI_STATUS_RX_DATA_AVAIL        (1<<21)

#define MCI_STATUS_ERRORS \
    (MCI_STATUS_DATA_CRC_FAIL|MCI_STATUS_DATA_TIME_OUT|MCI_STATUS_RX_OVERRUN| \
        MCI_STATUS_TX_UNDERRUN | MCI_STATUS_DATA_END|MCI_STATUS_START_BIT_ERR| \
            MCI_STATUS_DATA_BLOCK_END)

/*-------------------------------------------------------------------------*
 * Types:
 *-------------------------------------------------------------------------*/
typedef struct {
    const HAL_MCI *iHAL;

    T_uezGPIOPortPin iCardDetect;
    T_uezGPIOPortPin iWriteProtect;

    T_mciReceptionComplete iReceptionCompleteCallback;
    void *iReceptionCompleteCallbackWorkspace;

    T_mciTransmissionComplete iTransmissionCompleteCallback;
    void *iTransmissionCompleteCallbackWorkspace;

    TUInt32 iRCA;       // Relative Card Address

    HAL_GPDMA **iGPDMA;
    TBool iIRQActive;

    // Position in buffer array to receive data
    TUInt8 iBufferPosIn;

    // Position in buffer to take data out of
    TUInt8 iBufferPosOut;

    // Number we are writing
    TUInt8 iNumWriting;

    // Status of current transfer
    TUInt8 iTransferStatus;

    TUInt32 iLastMCIError;
} T_LPC1788_MCI_Workspace;

#define TRANSFER_STATUS_READING             0x01
#define TRANSFER_STATUS_WRITING             0x02
#define TRANSFER_STATUS_BUFFER_OVERRUN      0x04
#define TRANSFER_STATUS_MCI_ERROR           0x08
#define TRANSFER_STATUS_DONE                0x10
#define TRANSFER_STATUS_ANY_ERROR   \
    (TRANSFER_STATUS_BUFFER_OVERRUN|TRANSFER_STATUS_MCI_ERROR)

/*-------------------------------------------------------------------------*
 * Globals:
 *-------------------------------------------------------------------------*/
/* Block transfer FIFO -- MUST be placed in AHB memory */
static TUInt32 G_dmaBlocks[NUM_MAX_BLOCKS][128] MCI_MEMORY;
/* DMA link list -- MUST be placed in AHB memory */
static TUInt32 G_linkListRead[NUM_MAX_BLOCKS][4] MCI_MEMORY;
static TUInt32 G_linkListWrite[NUM_MAX_BLOCKS][4] MCI_MEMORY;
T_LPC1788_MCI_Workspace *G_mciWorkspace;

#define Copy_al2un          memcpy // TODO: Is this alright?

/*-------------------------------------------------------------------------*
 * Prototypes:
 *-------------------------------------------------------------------------*/
void LPC1788_MCI_ProcessInterrupt(T_LPC1788_MCI_Workspace *p);

/*---------------------------------------------------------------------------*
 * Interrupt:  LPC1788_MCI_Interrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      A MCI Interrupt has come in.  Process the one workspace attached
 *      to this interrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(LPC1788_MCI_Interrupt)
{
    IRQ_START();
    LPC1788_MCI_ProcessInterrupt(G_mciWorkspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_ProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Process an interrupt for this workspace
 * Inputs:
 *      void *aWorkspace          -- MCI Workspace
 * Outputs:
 *      void
 *---------------------------------------------------------------------------*/
void LPC1788_MCI_ProcessInterrupt(
    T_LPC1788_MCI_Workspace *p)
{
    TUInt32 ms;
    TUInt8 xs;
    //TUInt32 n;
    //T_gpdmaRequest r;

    /* Clear MCI interrupt status */
    ms = MCI_STATUS & MCI_STATUS_ERRORS;
    MCI_CLEAR = ms;

    xs = p->iTransferStatus;

    if (ms & MCI_STATUS_DATA_BLOCK_END) {
        /* A block transfer completed (DataBlockEnd) */
        if (xs & TRANSFER_STATUS_READING) {
            /* In card read operation */
            if (ms & MCI_STATUS_DATA_END) {
                /* When last block is received (DataEnd), */
                /* Pop off remaining data in the MCIFIFO */
                (*(p->iGPDMA))->BurstRequest(p->iGPDMA,
                    GPDMA_PERIPHERAL_SD_MMC);
            }
            /* Track where the next position is at */
            p->iBufferPosIn++;

            if (p->iReceptionCompleteCallback)
                p->iReceptionCompleteCallback(
                    p->iReceptionCompleteCallbackWorkspace);
        } else {
            /* In card write operation */
            /* Next write buffer */
            p->iBufferPosOut++;
            /* Are we done yet? */
            if (p->iBufferPosOut >= p->iNumWriting) {
                xs |= TRANSFER_STATUS_DONE;
                // Notify that we are complete
                if (p->iTransmissionCompleteCallback)
                    p->iTransmissionCompleteCallback(
                        p->iTransmissionCompleteCallbackWorkspace);
            }
        }
    } else {
        /* An MCI error occured (not DataBlockEnd) */
        xs |= TRANSFER_STATUS_MCI_ERROR;

        // Record the error
        p->iLastMCIError = ms;

        if (p->iTransferStatus & TRANSFER_STATUS_READING) {
            // Error during reading
            if (p->iReceptionCompleteCallback)
                p->iReceptionCompleteCallback(
                    p->iReceptionCompleteCallbackWorkspace);
        } else {
            // Error in writing
            if (p->iTransmissionCompleteCallback)
                p->iTransmissionCompleteCallback(
                    p->iTransmissionCompleteCallbackWorkspace);
        }
    }

    p->iTransferStatus = xs;

