FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_MCI.c
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the workspace for this LCD Controller
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_InitializeWorkspace(void *aWorkspace)
{
    TUInt32 n;
    TUInt32 dma_control;
    T_LPC1788_MCI_Workspace *p = (T_LPC1788_MCI_Workspace *)aWorkspace;
    p->iHAL = &LPC1788_MCI_Interface;

    p->iCardDetect = GPIO_NONE;
    p->iWriteProtect = GPIO_NONE;
    p->iReceptionCompleteCallback = 0;
    p->iReceptionCompleteCallbackWorkspace = 0;
    p->iRCA = 0;
    p->iGPDMA = 0;
    p->iIRQActive = EFalse;

    // Setup the GPDMA channel for reads
    dma_control = /*GPDMA_INT_ENABLE | */GPDMA_DI | GPDMA_DBWIDTH_32
        | GPDMA_SBWIDTH_32 | GPDMA_SBSIZE_8 | GPDMA_DBSIZE_8
        | GPDMA_TRANSFER_SIZE(512 / 4);

    /* Create link list */
    // Each link in the link list to copy from MCI_FIFO into a block
    // of memory in G_dmaBlocks.  The links to each other allow the whole
    // list of G_dmaBlocks blocks allow the complete dma buffers to be called.
    for (n = 0; n < NUM_MAX_BLOCKS; n++) {
        // MCI_FIFO -> G_dmaBlocks[n]
        G_linkListRead[n][0] = (TUInt32)&MCI_FIFO;
        G_linkListRead[n][1] = (TUInt32)G_dmaBlocks[n];
        G_linkListRead[n][2] = ((n+1)>=NUM_MAX_BLOCKS)?0:(TUInt32)G_linkListRead[n + 1];
        G_linkListRead[n][3] = dma_control;
    }

    // Setup the GPDMA channel for writes
    dma_control = /*GPDMA_INT_ENABLE | */GPDMA_SI | GPDMA_DBWIDTH_32
        | GPDMA_SBWIDTH_32 | GPDMA_SBSIZE_8 | GPDMA_DBSIZE_8
        | GPDMA_TRANSFER_SIZE(512 / 4);

    /* Create link list */
    // Each link in the link list to copy from MCI_FIFO into a block
    // of memory in G_dmaBlocks.  The links to each other allow the whole
    // list of G_dmaBlocks blocks allow the complete dma buffers to be called.
    for (n = 0; n < NUM_MAX_BLOCKS; n++) {
        // G_dmaBlocks[n] -> MCI_FIFO
        G_linkListWrite[n][0] = (TUInt32)G_dmaBlocks[n];
        G_linkListWrite[n][1] = (TUInt32)&MCI_FIFO;
        G_linkListWrite[n][2] = ((n+1)>=NUM_MAX_BLOCKS)?0:(TUInt32)G_linkListWrite[n + 1];
        G_linkListWrite[n][3] = dma_control;
    }

    G_mciWorkspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_PowerOn
 *---------------------------------------------------------------------------*
 * Description:
 *      Have the MCI power on the target
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_PowerOn(void *aWorkspace)
{
    // Turn on the power (if not already on), wait 10 ms minimum,
    // and then enable the signals
    LPC_MCI->POWER = 0x01;
    UEZTaskDelay(10);
    LPC_MCI->POWER = 0x03;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_PowerOff
 *---------------------------------------------------------------------------*
 * Description:
 *      Have the MCI power off the target
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_PowerOff(void *aWorkspace)
{
    MCI_MASK0 = 0;
    MCI_COMMAND = 0;
    MCI_DATA_CTRL = 0;

    MCI_POWER = 0; /* Power-off */
    MCI_CLOCK = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_Reset
 *---------------------------------------------------------------------------*
 * Description:
 *      Reset the MCI Controller
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_Reset(void *aWorkspace)
{
    // Reset MCI Registers
    LPC_MCI->MASK0 = 0;
    LPC_MCI->COMMAND = 0;
    LPC_MCI->DATACTRL = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_SendCommand
 *---------------------------------------------------------------------------*
 * Description:
 *      Send the MCI Controller a standard command.  Commands are of the
 *      type MCI_CMDx or MCI_ACMDx.  Some commands require an argument.
 *      Depending on the command, a type of response (none, short, or long)
 *      may be returned in the passed aResponse.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt16 aCommand        -- Command number, MCI_ACMD for ACMD's.
 *      TUInt32 aArgument       -- Argument for command
 *      T_uezMCIResponseType aResponseType -- Response type to get back
 *      TUInt32 *aResponse      -- Place to store the response.
 * Outputs:
 *      TBool                   -- ETrue if successful, else EFalse.
 *---------------------------------------------------------------------------*/
TBool LPC1788_MCI_SendCommand(
    void *aWorkspace,
    TUInt16 aCommand,
    TUInt32 aArgument,
    T_uezMCIResponseType aResponseType,
    TUInt32 *aResponse)
{
    TUInt32 status, command;
    TUInt32 startTimeout;
    T_LPC1788_MCI_Workspace *p = (T_LPC1788_MCI_Workspace *)aWorkspace;

    /* Send a MCI_CMD55 prior to the specified command if it is MCI_ACMD class */
    if (aCommand & 0x80) {
        /* If MCI_CMD55 is fails, exit with error */
        if (!LPC1788_MCI_SendCommand(aWorkspace, MCI_CMD55, (TUInt32)p->iRCA << 16UL,
            UEZ_MCI_RESPONSE_TYPE_SHORT, aResponse) || !(aResponse[0] & 0x00000020))
            return EFalse;
    }
    aCommand &= 0x3F; /* Mask out MCI_ACMD flag */

    do { /* Wait while CmdActive bit is set */
        MCI_COMMAND = 0; /* Cancel to transmit command */
        MCI_CLEAR = 0x0C5; /* Clear status flags */
        for (status = 0; status < 10; status++)
            MCI_STATUS; /* Skip lock out time of command reg. */
    } while (MCI_STATUS & 0x00800);

