FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_MCI.c
    MCI_ARGUMENT = aArgument; /* Set the argument into argument register */
    command = 0x400 | aCommand; /* Enable bit + aCommand */
    if (aResponseType == 1)
        command |= 0x040; /* Set Response bit to reveice short resp */
    if (aResponseType > 1)
        command |= 0x0C0; /* Set Response and LongResp bit to receive long resp */
    MCI_COMMAND = command; /* Initiate command transaction */

    startTimeout = UEZTickCounterGet();
    for (;;) { /* Wait for end of the cmd/resp transaction */
        if (UEZTickCounterGetDelta(startTimeout) > 100)
            return EFalse;
        status = MCI_STATUS; /* Get the transaction status */
        if (aResponseType == UEZ_MCI_RESPONSE_TYPE_NONE) {
            /* No response */
            if (status & 0x080) {
                /* CmdSent */
                /* No response, so stop here */
                return ETrue;
            }
        } else {
            /* Short or long response */
            if (status & MCI_STATUS_CMD_RESP_END) {
                break;
            }
            if (status & MCI_STATUS_CMD_CRC_FAIL) {
                if (aCommand == 1 || aCommand == 12 || aCommand == 41) {
                    /* Ignore resp CRC error on MCI_CMD1/12/41 */
                    break;
                }
                return EFalse;
            }
            if (status & 0x004) {
                /* CmdTimeOut */
                return EFalse;
            }
        }
    }

    /* Got a short or long response */
    /* Read the response words */
    aResponse[0] = MCI_RESP0;
    if (aResponseType == UEZ_MCI_RESPONSE_TYPE_RESPONSE_LONG) {
        aResponse[1] = MCI_RESP1;
        aResponse[2] = MCI_RESP2;
        aResponse[3] = MCI_RESP3;
    }

    return ETrue; /* Return with success */
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_ReadyReception
 *---------------------------------------------------------------------------*
 * Description:
 *      Prepare the MCI Controller for receiving blocks of data of the
 *      given size (usually 512 bytes).  When each block is received, call
 *      the given callback routine.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt32 aNumBlocks      -- Number of blocks to receive
 *      TUInt32 aBlockSize      -- Block size.  Should be multiple of 4 and
 *                                  a power of 2.  Currently only 512 supported.
 *      T_mciReceptionComplete aReceptionCallback - Callback routine when
 *                                  received block.
 *      void *aReceptionCallbackWorkspace -- Workspace for callback.
 *      TUInt32 aNumBlocksReady -- Number of blocks readied equal or or less
 *                                  than aNumBlocks.  Can be zero.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_ReadyReception(
    void *aWorkspace,
    TUInt32 aNumBlocks,
    TUInt32 aBlockSize,
    T_mciReceptionComplete aReceptionCallback,
    void *aReceptionCallbackWorkspace,
    TUInt32 *aNumBlocksReady) // TODO: Comment this everywhere
{
    T_gpdmaRequest r;
    T_LPC1788_MCI_Workspace *p = (T_LPC1788_MCI_Workspace *)aWorkspace;

    // Limit the number of blocks allowed to the length of our buffer
    if (aNumBlocks > NUM_MAX_BLOCKS)
        aNumBlocks = NUM_MAX_BLOCKS;
    *aNumBlocksReady = aNumBlocks;

    p->iReceptionCompleteCallback = aReceptionCallback;
    p->iReceptionCompleteCallbackWorkspace = aReceptionCallbackWorkspace;

    /* --------- Setting up block indexes ---------- */
    /* Block FIFO R/W index */
    p->iBufferPosOut = 0;
    p->iBufferPosIn = 0;
    p->iTransferStatus = TRANSFER_STATUS_READING;

    /* --------- Setting up DMA request ---------- */
    // Setup the first request
    r.iControl = /*GPDMA_INT_ENABLE | */GPDMA_DI | GPDMA_DBWIDTH_32
        | GPDMA_SBWIDTH_32 | GPDMA_SBSIZE_8 | GPDMA_DBSIZE_8;
    r.iSourcePeripheral = GPDMA_PERIPHERAL_SD_MMC;
    r.iSourceAddr = G_linkListRead[0][0];
    r.iDestinationPeripheral = GPDMA_PERIPHERAL_MEMORY;
    r.iDestinationAddr = G_linkListRead[0][1];
    r.iLinkedList = (void *)G_linkListRead[0][2];
    r.iNumTransferItems = GPDMA_TRANSFER_SIZE(aBlockSize / 4);
    r.iFlowControl = GPDMA_FLOW_CONTROL_DMA;

    (*p->iGPDMA)->PrepareRequest(p->iGPDMA, &r, 0, 0);
    (*p->iGPDMA)->Start(p->iGPDMA);

    /* --------- Setting up MCI ---------- */
    // Set data length
    MCI_DATA_LEN = 512 * aNumBlocks;
    // Data timer: 0.2sec
//    MCI_DATA_TMR = (TUInt32)(SDCARD_MCI_RATE_FOR_RW_STATE * 0.2);
    MCI_DATA_TMR = (TUInt32)(SDCARD_MCI_RATE_FOR_RW_STATE * 2.0);
    // Clear status flags for errors
    MCI_CLEAR = MCI_STATUS_ERRORS;
    MCI_MASK0 = MCI_STATUS_ERRORS;
//    for (n = 0; aBlockSize > 1; aBlockSize >>= 1, n += 0x10)
//        ;
    /* Start to receive data blocks */
    MCI_DATA_CTRL = (9<<4) /*n*/ | 0xB;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_ReadyTransmission
 *---------------------------------------------------------------------------*
 * Description:
 *      Prepare for a number of write block transactions.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt32 aNumBlocks      -- Number of total blocks to write
 *      TUInt32 aBlockSize      -- Size of each block (only 512 supported)
 *      T_mciReceptionComplete aTranmissionCallback -- Routine to call
 *                                  when complete from interrupt.
 *      void *aTransmissionCallbackWorkspace -- Workspace for callback.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_ReadyTransmission(
    void *aWorkspace,
    TUInt32 aNumBlocks,
    TUInt32 aBlockSize,
    TUInt32 *aNumWriting)
{
    T_LPC1788_MCI_Workspace *p = (T_LPC1788_MCI_Workspace *)aWorkspace;

    // This implementation only supports 512 byte blocks!
    if (aBlockSize != 512)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Determine how many blocks we are going to write (based on the
    // number requested to send and how much room we got).
    *aNumWriting = aNumBlocks;
    if (*aNumWriting >= NUM_MAX_BLOCKS)
        *aNumWriting = NUM_MAX_BLOCKS-1;
    p->iNumWriting = *aNumWriting;

