FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_MCI.c
    // Setup indexes
    p->iBufferPosOut = 0;
    p->iBufferPosIn = 0;
    p->iTransferStatus = TRANSFER_STATUS_WRITING;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_StartTransmission
 *---------------------------------------------------------------------------*
 * Description:
 *      Start writing blocks as they are written
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt32 aNumBlocks      -- Number of total blocks to write
 *      TUInt32 aBlockSize      -- Size of each block (only 512 supported)
 *      T_mciReceptionComplete aTranmissionCallback -- Routine to call
 *                                  when complete from interrupt.
 *      void *aTransmissionCallbackWorkspace -- Workspace for callback.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_StartTransmission(
    void *aWorkspace,
    T_mciTransmissionComplete aTransmissionCallback,
    void *aTransmissionCallbackWorkspace)
{
    T_gpdmaRequest r;
    T_LPC1788_MCI_Workspace *p = (T_LPC1788_MCI_Workspace *)aWorkspace;

    // Set the callback routine (if any)
    p->iTransmissionCompleteCallback = aTransmissionCallback;
    p->iTransmissionCompleteCallbackWorkspace = aTransmissionCallbackWorkspace;

    // Load first LLI
    r.iSourcePeripheral = GPDMA_PERIPHERAL_MEMORY;
    r.iSourceAddr = G_linkListWrite[0][0];
    r.iDestinationPeripheral = GPDMA_PERIPHERAL_SD_MMC;
    r.iDestinationAddr = G_linkListWrite[0][1];
    r.iLinkedList = (void *)G_linkListWrite[0][2];
    r.iNumTransferItems = GPDMA_TRANSFER_SIZE(512 / 4);
    r.iFlowControl = GPDMA_FLOW_CONTROL_DMA;
    r.iControl = /*GPDMA_INT_ENABLE | */GPDMA_SI | GPDMA_DBWIDTH_32
        | GPDMA_SBWIDTH_32 | GPDMA_SBSIZE_8 | GPDMA_DBSIZE_8;

    /* Transfer status: Memory --> MCI*/
    (*p->iGPDMA)->PrepareRequest(p->iGPDMA, &r, 0, 0);
    (*p->iGPDMA)->Start(p->iGPDMA);

    // Set total data length
    MCI_DATA_LEN = 512 * (p->iNumWriting+1);
    // Data timer: 0.2sec
    MCI_DATA_TMR = (TUInt32)(SDCARD_MCI_RATE_FOR_RW_STATE * 2.0);
    // Clear status flags
    MCI_CLEAR = 0x51A;
    // DataBlockEnd StartBitErr DataEnd RxOverrun DataTimeOut DataCrcFail
    MCI_MASK0 = 0x51A;

    // Start to transmit data blocks (enable for DMA)
    MCI_DATA_CTRL = (9<<4) | 0x9;

    return UEZ_ERROR_NONE;
}


/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_StopTransfer
 *---------------------------------------------------------------------------*
 * Description:
 *      Halt any transfers possibly in progress regardless of state.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_StopTransfer(void *aWorkspace)
{
    T_LPC1788_MCI_Workspace *p = (T_LPC1788_MCI_Workspace *)aWorkspace;

    /* Disable MCI interrupt */
    MCI_MASK0 = 0;

    /* Stop MCI data transfer */
    MCI_DATA_CTRL = 0;

    /* Disable DMA ch-0 */
    (*p->iGPDMA)->Stop(p->iGPDMA);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_Read
 *---------------------------------------------------------------------------*
 * Description:
 *      Read a block waiting to be received.  Currently only supports
 *      512 byte blocks.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      void *aBuffer           -- Buffer to receive 512 byte block
 *      TUInt32 aReadSize       -- Size of block to read
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_Read(void *aWorkspace, void *aBuffer, TUInt32 aReadSize)
{
    T_LPC1788_MCI_Workspace *p = (T_LPC1788_MCI_Workspace *)aWorkspace;

    // This implementation only supports 512 byte blocks!
    if (aReadSize != 512)
        return UEZ_ERROR_INVALID_PARAMETER;

    // If an error has occurred, report this
    if (p->iTransferStatus & TRANSFER_STATUS_ANY_ERROR) {
        return UEZ_ERROR_READ_WRITE_ERROR;
    }

    // If there is no data (yet), report this
    if (p->iBufferPosOut == p->iBufferPosIn)
        return UEZ_ERROR_OUT_OF_DATA;

    // Copy over a block of data
    Copy_al2un(aBuffer, G_dmaBlocks[p->iBufferPosOut], aReadSize);

    /* Next buffer block */
    p->iBufferPosOut++;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_Write
 *---------------------------------------------------------------------------*
 * Description:
 *      Write a block of data to the MCI controller.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      void *aBuffer           -- Data to write to controller
 *      TUInt32 aNumBytes       -- Number of bytes to write (usually 512)
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_Write(
    void *aWorkspace,
    const TUInt8 *aBuffer,
    TUInt32 aNumBytes)
{
    T_LPC1788_MCI_Workspace *p = (T_LPC1788_MCI_Workspace *)aWorkspace;

    // This implementation only supports 512 byte blocks!
    if (aNumBytes != 512)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Is there room?
    if (p->iBufferPosIn >= p->iNumWriting)
        return UEZ_ERROR_OUT_OF_SPACE;

    // If an error has occurred, report this
    if (p->iTransferStatus & TRANSFER_STATUS_ANY_ERROR) {
        return UEZ_ERROR_READ_WRITE_ERROR;
    }

    // There is a block, write it
    Copy_al2un(G_dmaBlocks[p->iBufferPosIn], aBuffer, 512);

    /* Next DMA buffer */
    p->iBufferPosIn++;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_SetRelativeCardAddress
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the active RCA (Relative Card Address).
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt32 aRCA            -- Relative Card Address (RCA)
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_SetRelativeCardAddress(void *aWorkspace, TUInt32 aRCA)
{
    T_LPC1788_MCI_Workspace *p = (T_LPC1788_MCI_Workspace *)aWorkspace;
    p->iRCA = aRCA;
    
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_SetClockRate
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the clocking rate of the MCI bus clock in Hz.  If power save
 *      mode is set, the clock is only run when communications is active,
 *      otherwise it is run continuously.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt32 aHz             -- Clock rate in Hz.
 *      TBool aPowerSave        -- ETrue to save power by running the clock
 *                                  only when active, else EFalse to run
 *                                  clock continuously.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_SetClockRate(
    void *aWorkspace,
    TUInt32 aHz,
    TBool aPowerSave)
{
    TUInt32 clock;
    TUInt32 div;
    PARAM_NOT_USED(aWorkspace);

    // Power save means the clock ONLY runs when needed, otherwise the SD CLK
    // runs continously.
    if (aHz == 0) {
        LPC_MCI->CLOCK &= ~0x100;
    } else {
        clock = PCLK_FREQUENCY/2;
        div = 0;
        while ((clock / (div+1)) > aHz)
            div++;

        LPC_MCI->CLOCK = (LPC_MCI->CLOCK & 0x00000C00) | (1<<8)
            | (div)
            | (aPowerSave ? (1<<9) : 0);
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_MCI_SetDataBus
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the type of MCI bus active.  MCI device will initialize to
 *      1 bit bus.  Used to go into 4 bit parallel mode.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      T_uezMCIBus aBus        -- Type of bus (1-bit or 4-bit)
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_MCI_SetDataBus(void *aWorkspace, T_uezMCIBus aBus)
{
    switch (aBus) {
        case UEZ_MCI_BUS_4BIT_WIDE:
            LPC_MCI->CLOCK |= 0x800;
            break;
        case UEZ_MCI_BUS_1BIT_WIDE:
            LPC_MCI->CLOCK &= ~0x800;
            break;
        default:
            return UEZ_ERROR_INVALID_PARAMETER;
    }
    return UEZ_ERROR_NONE;
}

TBool LPC1788_MCI_IsWriteAvailable(void *aWorkspace)
{
    T_LPC1788_MCI_Workspace *p = (T_LPC1788_MCI_Workspace *)aWorkspace;

    // Determine if there is room available.  If there is room, then ETrue
    if (p->iBufferPosIn < p->iNumWriting)
        return ETrue;

    return EFalse;
}

