FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_MCI.c
TBool LPC1788_MCI_IsWriteEmpty(void *aWorkspace)
{
    T_LPC1788_MCI_Workspace *p = (T_LPC1788_MCI_Workspace *)aWorkspace;

    // Have all the blocks been written?  It not, then EFalse.
    if (p->iBufferPosOut < p->iNumWriting)
        return EFalse;

    return ETrue;
}


/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const HAL_MCI LPC1788_MCI_Interface = { {
    "LPC1788:MCI",
    0x0204,
    LPC1788_MCI_InitializeWorkspace,
    sizeof(T_LPC1788_MCI_Workspace), },

// v2.04
    LPC1788_MCI_PowerOn,
    LPC1788_MCI_PowerOff,
    LPC1788_MCI_Reset,
    LPC1788_MCI_SendCommand,
    LPC1788_MCI_ReadyReception,
    LPC1788_MCI_StopTransfer,
    LPC1788_MCI_Read,
    LPC1788_MCI_SetRelativeCardAddress,
    LPC1788_MCI_SetClockRate,
    LPC1788_MCI_SetDataBus,
    LPC1788_MCI_ReadyTransmission,
    LPC1788_MCI_StartTransmission,
    LPC1788_MCI_Write,
    LPC1788_MCI_IsWriteAvailable,
    LPC1788_MCI_IsWriteEmpty,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1788_MCI_Require(const T_LPC1788_MCI_Pins *aPins, const char *aGPDMA)
{
    T_halWorkspace *p_mci;
    T_LPC1788_MCI_Workspace *p;

    static const T_LPC1788_IOCON_ConfigList pinsDAT0[] = {
            {GPIO_P0_22, IOCON_D_DEFAULT(2)},
            {GPIO_P1_6,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1788_IOCON_ConfigList pinsDAT1[] = {
            {GPIO_P1_7,  IOCON_D_DEFAULT(2)},
            {GPIO_P2_11, IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1788_IOCON_ConfigList pinsDAT2[] = {
            {GPIO_P1_11, IOCON_D_DEFAULT(2)},
            {GPIO_P2_12, IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1788_IOCON_ConfigList pinsDAT3[] = {
            {GPIO_P1_12, IOCON_D_DEFAULT(2)},
            {GPIO_P2_13, IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1788_IOCON_ConfigList pinsCLK[] = {
            {GPIO_P0_19, IOCON_D_DEFAULT(2)},
            {GPIO_P1_2,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1788_IOCON_ConfigList pinsCMD[] = {
            {GPIO_P0_20, IOCON_D_DEFAULT(2)},
            {GPIO_P1_3,  IOCON_D_DEFAULT(2)},
    };

    HAL_DEVICE_REQUIRE_ONCE();

    LPC1788_GPIO0_Require();
    LPC1788_GPIO1_Require();
    LPC1788_GPIO2_Require();

    // Register MCI Controller
    HALInterfaceRegister("MCI",
            (T_halInterface *)&LPC1788_MCI_Interface, 0, &p_mci);
    p = (T_LPC1788_MCI_Workspace *)p_mci;

    // Turn on the MCI Controller
    LPC1788PowerOn(1<<28);

    // Lock GPIO pins, if any
    p->iCardDetect = aPins->iCardDetect;
    p->iWriteProtect = aPins->iWriteProtect;
    if (p->iCardDetect != GPIO_NONE)
        UEZGPIOLock(p->iCardDetect);
    if (p->iWriteProtect != GPIO_NONE)
        UEZGPIOLock(p->iWriteProtect);

    LPC1788_IOCON_ConfigPin(aPins->iDAT0, pinsDAT0, ARRAY_COUNT(pinsDAT0));
    LPC1788_IOCON_ConfigPin(aPins->iDAT1, pinsDAT1, ARRAY_COUNT(pinsDAT1));
    LPC1788_IOCON_ConfigPin(aPins->iDAT2, pinsDAT2, ARRAY_COUNT(pinsDAT2));
    LPC1788_IOCON_ConfigPin(aPins->iDAT3, pinsDAT3, ARRAY_COUNT(pinsDAT3));
    LPC1788_IOCON_ConfigPin(aPins->iCLK, pinsCLK, ARRAY_COUNT(pinsCLK));
    LPC1788_IOCON_ConfigPin(aPins->iCMD, pinsCMD, ARRAY_COUNT(pinsCMD));

    // Reset MCI Registers
    LPC_MCI->MASK0 = 0;
    LPC_MCI->COMMAND = 0;
    LPC_MCI->DATACTRL = 0;

    // Setup interrupt for the MCI
    InterruptRegister(MCI_IRQn, LPC1788_MCI_Interrupt,
        INTERRUPT_PRIORITY_NORMAL, "MCI");
    InterruptEnable(MCI_IRQn);

    // Find the GPDMA HAL driver
    HALInterfaceFind(aGPDMA, (T_halWorkspace **)&p->iGPDMA);

    if ((((TUInt32)&G_dmaBlocks) & 0xFFF00000) != 0x20000000) {
        // The G_dmaBlocks and G_linkList must be in AHB0 or AHB1 memory
        // at about 0x20000000 - 0x2007FFFF.  If it didn't get put there,
        // the code was not compiled correctly!
        UEZFailureMsg("MCI memory space error!");
    }
}

/*-------------------------------------------------------------------------*
 * End of File:  LPC1788_MCI.c
 *-------------------------------------------------------------------------*/
